//  <br className="hidden md:block" />

export const IdentityIntroSection: string = `
نظراً لوجود حاجةٍ لنقل التعليم الشرعي الأكاديمي إلى مرحلةٍ متقدمة أكثرَ عُمقاً وتخصصا 
<br className="hidden md:block" />
 وتقديمِ قيمةٍ نوعيةٍ تحفظ مكانةَ الشامِ في محافل أكاديمية محليةٍ ودولية وفق تخصصات دقيقة.
`;

export const OneGoalsSection: string = `مؤسسةٌ أكاديميةٌ رائدةٌ في العلوم الإسلامية والبحث العلمي، تساهم في عملية النهضة.
`;

export const TwoGoalsSection: string = `إعدادُ خرّيجٍ عالٍ في الدراية، فاعلٍ في    مجتمعه، وِفقَ أحدث الأساليب والمحتوى العلمي المتقدم.`;

type GoalItemType = {
  text: string;
  icon_src: string;
};
const imageFolder = "/images/goals";
export const ListGoalsSection: Array<GoalItemType> = [
  {
    text: `إرســــاء تعلـــيــــم جامـــعــي
 متــــمــــيز ضمــن معايـــــير الجودة.`,
    icon_src: `${imageFolder}/1.svg`,
  },
  {
    text: `إعــــداد كفـــــــاءات علميـــة متخصصـــــــــــــة مواكبـــــة لاحتياجــــــات المجتمــــــــــع.`,
    icon_src: `${imageFolder}/2.svg`,
  },
  {
    text: `تهيئــــــة بيئـــــــة تعليمــــية جاذبة ومحفــــــزة للابتكــــار والريادة.`,
    icon_src: `${imageFolder}/3.svg`,
  },
  {
    text: `تعزيز الشخصيــــــة التربـــــوية الثقافية وتنميــة حـب العلم والبحث العلمــي والعــــــــمل الجماعــــــــــــي وتشجيــــــــــــع التفــــــــــوق والابتكار.`,
    icon_src: `${imageFolder}/4.svg`,
  },
  {
    text: `تقديــــــــــــــم الخدمـــــــــــــــــات التعليميــة والاستشــــــــــاريـة لمؤسســـــــــــات المجتمـــــــع
 العامة والخاصة.`,
    icon_src: `${imageFolder}/5.svg`,
  },
  {
    text: `تحقيــــق شـــــــــراكات مــع الجامعــــــــــات المحليــــــــة والدولية ذات الأهــــــــداف المماثلة .`,
    icon_src: `${imageFolder}/6.svg`,
  },
];

export const WhoUsCardsText: Array<{ text: string; image: string }> = [
  {
    image: "/images/goals/green/1.svg",
    text: "لأنهـــــــــــا ترجمــــــة لرغبـــة المجتمع في دعم تعليم متخصص، يساهـم فــــــي ازدهـــار ونهضـــــة ســــوريا يستنـــــد علـــى التمــــــويل الوقفي والخيري.",
  },
  {
    image: "/images/goals/green/2.svg",
    text: "لكونها تهدف لدعم و تعزز قــــــــــدرات الطــــلاب عــلى الاندماج المهني بجدارة.",
  },
  {
    image: "/images/goals/green/3.svg",
    text: "لكونهـــا جامعــــة تسعــى لتكـــــون متفاعلــــــة مـــع محيطها بقوة وإيجابية.",
  },
  {
    image: "/images/goals/green/4.svg",
    text: "لأننـــــــــا نسعــى لخلـــــــق تنافسية إيجابيـة بيــــــــــن المؤسســات الجامعيـــــة التي تسعى إلى التطويــر والإبداع والابتكار الهادف.",
  },
  {
    image: "/images/goals/green/5.svg",
    text: "لنكــــــــــــــــون داعميـــــــــن للمؤسســــتات العامـــــــــة والخاصــــــــة بالاستشــارات الأكاديميــــة والأبحـــــــــاث والدراسات.",
  },
];
